InformationRegisters/ПубличныеИдентификаторыБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыБухгалтерии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриОбмене</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФорматаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПравилаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибкиОтражения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриПроверке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Множественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанныеИдентификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дополнительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязанныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиОтраженияДокументовВБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиОтраженияДокументовВБухгалтерии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияДанныхЧерезУниверсальныйФормат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтражения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазделыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПубличныеИдентификаторыБухгалтерии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОбновлениеДанных(ИнтерактивныйЗапуск = Истина) Экспорт
	
	НастройкаСсылка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	Если НастройкаСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательДляИнтеграции = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ПользовательДляИнтеграции(НастройкаСсылка);
	Если ПользовательДляИнтеграции.Пустая()
		Или ИнтерактивныйЗапуск Тогда
		ПользовательДляИнтеграции = Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеПодключения = СовместноеИспользованиеИнтеграция.НовоеПодключениеКСервису(ПользовательДляИнтеграции);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ОписаниеПодключения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПриложения = СовместноеИспользованиеИнтеграция.ПолучитьНастройкиПриложения(ОписаниеПодключения);
	НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
	НастройкаОбъект.НастройкиПриложения = ОбщегоНазначения.ЗначениеВJSON(НастройкиПриложения);
	НастройкаОбъект.Записать();
	
	СпискиИзменений = СовместноеИспользованиеИнтеграция.ПодготовитьСпискиИзмененийСинхронизируемыхОбъектов(ОписаниеПодключения, НастройкаСсылка);
	
	Если СпискиИзменений <> Неопределено Тогда
		Для Каждого ОписаниеСписка Из СпискиИзменений Цикл
			ТаблицаДанные = СовместноеИспользованиеИнтеграция.ПолучитьИзмененияСинхронизируемыхОбъектов(ОписаниеПодключения, ОписаниеСписка.Идентификатор);
			
			СписокИдентификаторов = Новый Массив;
			
			Для Каждого СтрокаДанные Из ТаблицаДанные Цикл
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Идентификатор.Установить(СтрокаДанные.Идентификатор);
				НаборЗаписей.Отбор.ИдентификаторМетаданных.Установить(СтрокаДанные.ИдентификаторМетаданных);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					ЗаписьНабора = НаборЗаписей[0];
				Иначе
					ЗаписьНабора = НаборЗаписей.Добавить();
				КонецЕсли;
					
				ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаДанные);
				
				// Принудительная проверка при обновлении данных публичных идентификаторов.
				ЗаписьНабора.ВерсияПравилаПроверки = "";
				
				НаборЗаписей.Записать();
				
				Если ЗначениеЗаполнено(СтрокаДанные.ПубличныйИдентификатор) Тогда
					СписокИдентификаторов.Добавить(СтрокаДанные.ПубличныйИдентификатор);
				КонецЕсли;
			КонецЦикла;
			
			СовместноеИспользованиеИнтеграция.УдалитьРегистрациюИзмененийСинхронизируемыхОбъектов(ОписаниеПодключения, ОписаниеСписка.Идентификатор);
			
			// Отправляем в бухгалтерию данные бизнеса по публичным идентификаторам (навигационную ссылку и представление).
			Если СписокИдентификаторов.Количество() > 0 Тогда
				ДанныеИдентификаторов = ДанныеПубличныхИдентификаторовБизнеса(НастройкаСсылка, СписокИдентификаторов);
				
				СовместноеИспользованиеИнтеграция.ОтправитьДанныеПубличныхИдентификаторовБизнеса(ОписаниеПодключения, ДанныеИдентификаторов);
			КонецЕсли;
		КонецЦикла;
		
		Справочники.НастройкиОтраженияДокументовВБухгалтерии.ЗафиксироватьСостояниеОбновления(НастройкаСсылка, ТекущаяУниверсальнаяДата());
	КонецЕсли;
	
	СовместноеИспользованиеИнтеграция.ЗавершитьСеанс(ОписаниеПодключения);
	
	ВыполнитьПроверкуДанных(НастройкаСсылка);
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПроверкуДанных(НастройкаСсылка)
	
	ПравилаПроверки = СовместноеИспользование.ПравилаПроверкиДанных();
	
	УзелОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "УзелОбмена");   
	
	ЗначенияНастроек = Новый Структура;
	СовместноеИспользованиеПереопределяемый.ПередПроверкойДанных(ЗначенияНастроек);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.ПустаяСсылка КАК ПустаяСсылка,
	|	Т.ВерсияПравила КАК ВерсияПравила
	|ПОМЕСТИТЬ ВТ_ПравилаПроверки
	|ИЗ
	|	&ПравилаПроверки КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПубличныеИдентификаторы.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(ПубличныеИдентификаторы.Ссылка, НЕОПРЕДЕЛЕНО) КАК Ссылка,
	|	ПубличныеИдентификаторы.УзелИнформационнойБазы КАК УзелИнформационнойБазы,
	|	"""" КАК ПубличныйИдентификаторСсылки
	|ПОМЕСТИТЬ ОбъединенныеПубличныеИдентификаторы
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
	|ГДЕ
	|	ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелОбмена
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СвязанныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификатор,
	|	СвязанныеИдентификаторыСинхронизируемыхОбъектов.Ссылка,
	|	&УзелОбмена,
	|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор
	|ИЗ
	|	РегистрСведений.СвязанныеИдентификаторыСинхронизируемыхОбъектов КАК СвязанныеИдентификаторыСинхронизируемыхОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|		ПО СвязанныеИдентификаторыСинхронизируемыхОбъектов.Ссылка = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка
	|ГДЕ
	|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелОбмена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыБухгалтерии.Идентификатор КАК Идентификатор,
	|	ИдентификаторыБухгалтерии.ИдентификаторМетаданных КАК ИдентификаторМетаданных,
	|	ИдентификаторыБухгалтерии.ПометкаУдаления КАК ПометкаУдаления,
	|	ИдентификаторыБухгалтерии.Проведен КАК Проведен,
	|	ИдентификаторыБухгалтерии.Номер КАК Номер,
	|	ИдентификаторыБухгалтерии.Дата КАК Дата,
	|	ЕСТЬNULL(ПубличныеИдентификаторыОрганизации.Ссылка, НЕОПРЕДЕЛЕНО) КАК Организация,
	|	ИдентификаторыБухгалтерии.ВидОперации КАК ВидОперации,
	|	ИдентификаторыБухгалтерии.СуммаДокумента КАК СуммаДокумента,
	|	ИдентификаторыБухгалтерии.ВерсияФорматаДанных КАК ВерсияФорматаДанных,
	|	ИдентификаторыБухгалтерии.ДанныеОбъекта КАК ДанныеОбъекта,
	|	ИдентификаторыБухгалтерии.ВерсияПравилаПроверки КАК ВерсияПравилаПроверки,
	|	ИдентификаторыБухгалтерии.ПроблемыПриПроверке КАК ПроблемыПриПроверке,
	|	ИдентификаторыБухгалтерии.ТипДанных КАК ТипДанных,
	|	ВТ_ПравилаПроверки.ВерсияПравила КАК ВерсияПравила,
	|	ЕСТЬNULL(ПубличныеИдентификаторы.Ссылка, НЕОПРЕДЕЛЕНО) КАК Ссылка,
	|	ПубличныеИдентификаторы.ПубличныйИдентификаторСсылки КАК ПубличныйИдентификаторСсылки
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыБухгалтерии КАК ИдентификаторыБухгалтерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъединенныеПубличныеИдентификаторы КАК ПубличныеИдентификаторы
	|		ПО (ПубличныеИдентификаторы.Идентификатор = ИдентификаторыБухгалтерии.ПубличныйИдентификатор)
	|			И (ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелОбмена)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПравилаПроверки КАК ВТ_ПравилаПроверки
	|		ПО (ТИПЗНАЧЕНИЯ(ВТ_ПравилаПроверки.ПустаяСсылка) = ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ПубличныеИдентификаторы.Ссылка, НЕОПРЕДЕЛЕНО)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыОрганизации
	|		ПО (ПубличныеИдентификаторыОрганизации.Идентификатор = ИдентификаторыБухгалтерии.Организация)
	|			И (ПубличныеИдентификаторыОрганизации.УзелИнформационнойБазы = &УзелОбмена)
	|			И (ПубличныеИдентификаторыОрганизации.Ссылка ССЫЛКА Справочник.Организации)
	|ГДЕ
	|	ВТ_ПравилаПроверки.ВерсияПравила ЕСТЬ НЕ NULL 
	|	И ИдентификаторыБухгалтерии.ВерсияПравилаПроверки <> ВТ_ПравилаПроверки.ВерсияПравила");
	
	Запрос.УстановитьПараметр("ПравилаПроверки", ПравилаПроверки.Скопировать(, "ПустаяСсылка,ВерсияПравила"));
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДанныхОбъекта = Новый Структура("ПометкаУдаления,Проведен,Номер,Дата,ВидОперации,СуммаДокумента,Организация");
		ЗаполнитьЗначенияСвойств(СтруктураДанныхОбъекта, Выборка);
		
		Если Не ПустаяСтрока(Выборка.ДанныеОбъекта) Тогда
			ДополнительныеДанные = ОбщегоНазначения.JSONВЗначение(Выборка.ДанныеОбъекта, , Ложь);
			Для Каждого КлючЗначение Из ДополнительныеДанные Цикл
				СтруктураДанныхОбъекта.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
		КонецЕсли;
		
		ОписаниеОбъекта = Новый Структура;
		ОписаниеОбъекта.Вставить("ВерсияФорматаДанных", Выборка.ВерсияФорматаДанных);
		ОписаниеОбъекта.Вставить("ТипДанных", Выборка.ТипДанных);
		ОписаниеОбъекта.Вставить("ДанныеОбъекта", СтруктураДанныхОбъекта);
		
		РезультатПроверки = Новый Структура;
		РезультатПроверки.Вставить("ЕстьОшибкиОтражения", Ложь);
		РезультатПроверки.Вставить("ПроблемыПриПроверке", Новый Массив);
		РезультатПроверки.Вставить("Множественный", Ложь);
		РезультатПроверки.Вставить("СвязанныеИдентификаторы", Новый Массив);
		РезультатПроверки.Вставить("ЗаменяющаяСсылка", Неопределено);
		
		СовместноеИспользованиеПереопределяемый.ПриПроверкеДанныхСинхронизируемогоОбъекта(Выборка.Ссылка, ОписаниеОбъекта, РезультатПроверки, ЗначенияНастроек);
		
		Если ТипЗнч(РезультатПроверки.ЗаменяющаяСсылка) = Тип("Структура") Тогда
				
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Идентификатор.Установить(РезультатПроверки.ЗаменяющаяСсылка.Идентификатор);
			НаборЗаписей.Отбор.ИдентификаторМетаданных.Установить(РезультатПроверки.ЗаменяющаяСсылка.ИдентификаторМетаданных);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				ЗаписьНабора = НаборЗаписей[0];
			Иначе
				ЗаписьНабора = НаборЗаписей.Добавить();    
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(ЗаписьНабора, РезультатПроверки.ЗаменяющаяСсылка);
			ЗаписьНабора.ВерсияПравилаПроверки = Выборка.ВерсияПравила;
			ЗаписьНабора.ЕстьОшибкиОтражения = РезультатПроверки.ЕстьОшибкиОтражения;
			ЗаписьНабора.ПроблемыПриПроверке = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.ПроблемыПриПроверке);
			ЗаписьНабора.Множественный = РезультатПроверки.Множественный;
			ЗаписьНабора.СвязанныеИдентификаторы = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.СвязанныеИдентификаторы);  

			НаборЗаписей.Записать();   
		Иначе   
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
			НаборЗаписей.Отбор.ИдентификаторМетаданных.Установить(Выборка.ИдентификаторМетаданных);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				ЗаписьНабора = НаборЗаписей[0];
			Иначе
				ЗаписьНабора = НаборЗаписей.Добавить();
			КонецЕсли;
			
			ЗаписьНабора.ВерсияПравилаПроверки = Выборка.ВерсияПравила;
			ЗаписьНабора.ЕстьОшибкиОтражения = РезультатПроверки.ЕстьОшибкиОтражения;
			ЗаписьНабора.ПроблемыПриПроверке = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.ПроблемыПриПроверке);
			ЗаписьНабора.Множественный = РезультатПроверки.Множественный;
			ЗаписьНабора.СвязанныеИдентификаторы = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.СвязанныеИдентификаторы);  

			НаборЗаписей.Записать();   
		КонецЕсли;
		
		Если РезультатПроверки.Множественный Тогда
			ОбщийПроведен = Истина;
			Для Каждого СвязанныйИдентификатор Из РезультатПроверки.СвязанныеИдентификаторы Цикл 
				Если СвязанныйИдентификатор.Идентификатор = Выборка.Идентификатор
					И СвязанныйИдентификатор.ИдентификаторМетаданных = Выборка.ИдентификаторМетаданных Тогда
					Продолжить;
				КонецЕсли;
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Идентификатор.Установить(СвязанныйИдентификатор.Идентификатор);
				НаборЗаписей.Отбор.ИдентификаторМетаданных.Установить(СвязанныйИдентификатор.ИдентификаторМетаданных);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					ЗаписьНабора = НаборЗаписей[0];
				Иначе
					ЗаписьНабора = НаборЗаписей.Добавить();
				КонецЕсли;
				
				ЗаписьНабора.ВерсияПравилаПроверки = Выборка.ВерсияПравила;
				ЗаписьНабора.ЕстьОшибкиОтражения = РезультатПроверки.ЕстьОшибкиОтражения;
				ЗаписьНабора.ПроблемыПриПроверке = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.ПроблемыПриПроверке);
				ЗаписьНабора.Множественный = РезультатПроверки.Множественный;
				ЗаписьНабора.СвязанныеИдентификаторы = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.СвязанныеИдентификаторы);  

				НаборЗаписей.Записать();      
				
				ОбщийПроведен = ОбщийПроведен И ЗаписьНабора.Проведен;
						
			КонецЦикла; 
			Если ЗначениеЗаполнено(Выборка.ПубличныйИдентификаторСсылки) Тогда    
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.ПубличныйИдентификаторСсылки);
				НаборЗаписей.Отбор.ИдентификаторМетаданных.Установить(Выборка.ИдентификаторМетаданных);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					ЗаписьНабора = НаборЗаписей[0];
				Иначе
					ЗаписьНабора = НаборЗаписей.Добавить();
				КонецЕсли;

				ЗаписьНабора.Идентификатор = Выборка.ПубличныйИдентификаторСсылки;
				ЗаписьНабора.ИдентификаторМетаданных = Выборка.ИдентификаторМетаданных;
				ЗаписьНабора.ПубличныйИдентификатор = Выборка.ПубличныйИдентификаторСсылки;
				ЗаписьНабора.ВерсияПравилаПроверки = Выборка.ВерсияПравила;
				ЗаписьНабора.ЕстьОшибкиОтражения = РезультатПроверки.ЕстьОшибкиОтражения;
				ЗаписьНабора.ПроблемыПриПроверке = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.ПроблемыПриПроверке);
				ЗаписьНабора.Множественный = РезультатПроверки.Множественный;  
				ЗаписьНабора.СвязанныеИдентификаторы = ОбщегоНазначения.ЗначениеВJSON(РезультатПроверки.СвязанныеИдентификаторы);  
				
				// Необходим для связи программно генерируемых при обмене документов
				ЗаписьНабора.Дополнительный = Истина;
				ЗаписьНабора.Проведен = ОбщийПроведен;

				НаборЗаписей.Записать();   
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Справочники.НастройкиОтраженияДокументовВБухгалтерии.ЗафиксироватьСостояниеОбновления(НастройкаСсылка, , Истина);
	
КонецПроцедуры

Функция ДанныеПубличныхИдентификаторовБизнеса(НастройкаСсылка, СписокИдентификаторов)
	
	ДанныеИдентификаторов = Новый ТаблицаЗначений;
	ДанныеИдентификаторов.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ДанныеИдентификаторов.Колонки.Добавить("ИдентификаторМетаданных", Новый ОписаниеТипов("Строка"));
	ДанныеИдентификаторов.Колонки.Добавить("НавигационнаяСсылка", Новый ОписаниеТипов("Строка"));
	ДанныеИдентификаторов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ДанныеИдентификаторов.Колонки.Добавить("ТипДанных", Новый ОписаниеТипов("Строка"));
	
	УзелОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "УзелОбмена");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПубличныеИдентификаторы.Идентификатор КАК Идентификатор,
	|	ПубличныеИдентификаторы.Ссылка КАК Ссылка,
	|	ТИПЗНАЧЕНИЯ(ПубличныеИдентификаторы.Ссылка) КАК ТипСсылки,
	|	ПРЕДСТАВЛЕНИЕ(ПубличныеИдентификаторы.Ссылка) КАК Представление
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
	|ГДЕ
	|	ПубличныеИдентификаторы.Идентификатор В(&СписокИдентификаторов)
	|	И ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелОбмена");
	Запрос.УстановитьПараметр("СписокИдентификаторов", СписокИдентификаторов);
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	ВыборкаИдентификаторы = Запрос.Выполнить().Выбрать();
	Пока ВыборкаИдентификаторы.Следующий() Цикл
		СтрокаДанные = ДанныеИдентификаторов.Добавить();
		СтрокаДанные.Идентификатор = ВыборкаИдентификаторы.Идентификатор;
		СтрокаДанные.ИдентификаторМетаданных = XMLСтрока(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ВыборкаИдентификаторы.ТипСсылки));
		СтрокаДанные.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаИдентификаторы.Ссылка);
		СтрокаДанные.Представление = ВыборкаИдентификаторы.Представление;
		СтрокаДанные.ТипДанных = Метаданные.НайтиПоТипу(ВыборкаИдентификаторы.ТипСсылки).ПолноеИмя();
	КонецЦикла;
	
	Возврат ДанныеИдентификаторов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
